Repository: clipos-archive/src_platform_anssipki-cli
Catalog: locales/*/LC_MESSAGES/anssipkicli.po
Languages: fr_fr

# CLI_USAGE
source: anssipkicli <option> Available options : -v, --version: print the program version and exit -h, --help: print this help and exit -i, --interactive: enter interactive mode -s, --scenario: execute a list of action from a file anssipkicli <action> <action parameters> Available actions :
fr_fr: anssipkicli <option> Options disponnibles : -v, --version: affiche la version du programme et quitte -h, --help: affiche cette aide et quitte -i, --interactive: entre en mode interactif -s, --scenario: exécute une liste d'action à partir d'un fichier anssipkicli <action> <paramètres de l'action> Actions disponibles :

# HOST_HSM_LOAD_FAIL
source: Host HSM load failed
fr_fr: Erreur lors du chargement du HSM.

# CLI_SMARTCARD_OPTION_HELP
source: Use smartcard for keypair generation.
fr_fr: Utilisation d'une carte à puce pour la génération du bi-clé.

# CLI_SCENARIO_USAGE
source: usage: scenario [FILE] Interactive mode. if FILE is provided, action are read from it.
fr_fr: usage: scenario [FILE] FILE: effectue une liste d'actions depuis un fichier Si aucun fichier n'est précisé, le mode interactif est lancé.

# CLI_INVALID_OPTION
source: Invalid action %s
fr_fr: Action (%s) invalide

# CLI_INVALID_KEY_ALGO
source: Invalid keyAlgo %s
fr_fr: Type de clé (%s) invalide

# CLI_INVALID_SIGN_ALGO
source: Invalid signAlgo %s
fr_fr: Algorithme de signature %s invalide

# CLI_INVALID_KU
source: Invalid KeyUsage %s
fr_fr: Champ(s) KeyUsage (%s) invalide(s)

# CLI_INVALID_EKU
source: Invalid ExtendedKeyUsage %s
fr_fr: Champ(s) ExtendedKeyUsage (%s) invalide(s)

# CLI_INVALID_SAN
source: Invalid SAN type %s
fr_fr: Champ(s) SAN (SubjectAltName) (%s) invalide(s)

# CLI_CERT_POL_OID_REDEFINITION
source: OID already defined
fr_fr: OID déjà défini

# CLI_CREATE_CERT_TEMPLATE_HELP
source: Template to use
fr_fr: Nom d'un template à utiliser.

# CLI_NAME_OPTION_HELP
source: Certificate internal name
fr_fr: Nom interne du certificat

# CLI_DN_OPTION_HELP
source: Subject distinguished name ("C=FR,ST=France,CN=www.mywebsite.com")
fr_fr: Sujet (Distinguished name)

# CLI_VALIDITY_OPTION_HELP
source: dd/mm/yyyy-dd/mm/yyyy : validity between two dates +XdXmXy : validity from now for a given period (example +3y for 3 years, +4d3m for 4 days and 3 months) dd/mm/yyyy+XdXmXy : validity from a given date for a given period
fr_fr: dd/mm/yyyy-dd/mm/yyyy : periode de validité entre deux dates +XdXmXy : période de validité pour une certaine periode à partir d'instant de génération dd/mm/yyyy+XdXmXy : période de validité pour une certaine periode à partir d'une date

# CLI_SAN_OPTION_HELP
source: Subject alternative name email:<Email address> URI:<Unified Resource Locator> DNS:<DNS name> IP:<Ip address>
fr_fr: Nom alternatif (SubjectAltName) email:<adresse Email> URI:<Unified Resource Locator> DNS:<nom DNS> IP:<adresse Ip>

# CLI_KEYSIZE_OPTION_HELP
source: Key pair size
fr_fr: Taille de clé à générer.

# CLI_KEYALGO_OPTION_HELP
source: Key pair algorithm
fr_fr: Type de clé à générer.

# CLI_SIGNALGO_OPTION_HELP
source: Signature algorithm to use
fr_fr: Algorithme de signature

# CLI_ISSUERDN_OPTION_HELP
source: Issuer CA subject distinguished name
fr_fr: DN de l'AC émettrice à utiliser.

# CLI_SELFSIGNED_OPTION_HELP
source: Create a selfsigned certificate
fr_fr: Génère un certificat auto-signé.

# CLI_KU_OPTION_HELP
source: Combination of key usage separated by ':' (DigitalSignature:NonRepudiation:KeyEncipherment:DataEncipherment: KeyAgreement:KeyCertSign:CRLSign:EncipherOnly:DecipherOnly)
fr_fr: Combinaison d'une suite de KeyUsage séparés par des ':' (DigitalSignature:NonRepudiation:KeyEncipherment:DataEncipherment: KeyAgreement:KeyCertSign:CRLSign:EncipherOnly:DecipherOnly)

# CLI_EKU_OPTION_HELP
source: (createcert action only)Combination of extended key usage separated by ':' (ServerAuth:ClientAuth:CodeSigning:EmailProtection: IPSecEndSystem:IPSecTunnel:IPSecUser:TimeStamping:OCSPSigning)
fr_fr: Combinaison d'une suite d'ExtendedKeyUsage séparés par des ':' (ServerAuth:ClientAuth:CodeSigning:EmailProtection: IPSecEndSystem:IPSecTunnel:IPSecUser:TimeStamping:OCSPSigning)

# CLI_CERTPOL_OPTION_HELP
source: List of certificate policies <OID>:<CPS_URI> separated by |
fr_fr: Liste de politiques de certification au format <OID>:<CPS_URI> séparés par un |

# CLI_OSSLEXT_OPTION_HELP
source: Generic extension definition (OpenSSL syntax)
fr_fr: Définition d'une extension v3 avec la syntaxe OpenSSL

# CLI_EXPORTCERT_USAGE
source: Write a certificate in PEM format.
fr_fr: Exporte le certificat au format PEM.

# CLI_EXPORTP12_USAGE
source: Export a certificate and its private keys protected by a password.
fr_fr: Exporte le certificat et sa clé privée dans un fichier PKCS#12 protégé par un mot de passe.

# CLI_EXPORTCSR_USAGE
source: Create a CSR from a root CA certificate.
fr_fr: Génère une CSR à partir d'un certificat d'AC racine.

# CLI_FEEDCARD_USAGE
source: Push a private key into a smartcard
fr_fr: Injecte une clé privée dans une carte à puce

# CLI_EXPORT_OUT_OPTION_HELP
source: Output file (default: <NAME_CERT>.(p12,pem)
fr_fr: Nom de fichier où exporter (par défaut: <NOM_CERTIFICAT>.(p12,pem)

# CLI_EXPORT_CHAIN_OPTION_HELP
source: Add issuers CA chain.
fr_fr: Ajoute les certificats des AC émettrices.

# CLI_EXPORT_PASSWORD_OPTION_HELP
source: Password used for PKCS#12 export
fr_fr: Mot de passe pour la génération du fichier PKCS#12

# CLI_EXPORT_RANDPASS_OPTION_HELP
source: Generate and use a random password for PKCS#12 export
fr_fr: Générer un mot de passe aléatoire pour l'export PKCS#12

# CLI_PASSWORD
source: password
fr_fr: mot de passe

# CLI_PASSWORD_MISMATCH
source: Password missmatch!
fr_fr: Les mots de passes ne correspondent pas !

# CLI_DN_NOT_SET_ERROR
source: Error: dn is not defined
fr_fr: Erreur: sujet (DN) non défini

# CLI_TEMPLATE_NOT_FOUND_ERROR
source: Error: template %s was not found
fr_fr: Erreur: le template %s n'a pas été trouvé

# CLI_VALIDITY_NOT_SET_ERROR
source: Error: validity is not defined
fr_fr: Erreur: Période de validité non définie.

# CLI_KU_NOT_SET_ERROR
source: Error: keyusage is not defined
fr_fr: Erreur: keyusage non défini(s)

# CLI_SA_NOT_SET_ERROR
source: Error: signalgo is not defined
fr_fr: Erreur: algorithme de signature non défini

# CLI_ISSUER_AND_SS_SET_ERROR
source: Error: issuerdn option must not be used with selfsigned option set
fr_fr: Erreur: issuerdn ne doit pas être utilisé quand l'option selfsigned est présente.

# CLI_NO_ISSUER_SET_ERROR
source: Error: issuerdn is not defined (or selfsigned is not set)
fr_fr: Erreur: aucun DN d'AC n'est défini.

# CLI_KS_NOT_SET_ERROR
source: Error: keysize is not defined
fr_fr: Erreur: Taille de clé à générer non définie.

# CLI_KA_NOT_SET_ERROR
source: Error: keyalgo is not defined
fr_fr: Erreur: Type de clé à générer non définie.

# CLI_CREATECERT_KCS_KU_SET_ERROR
source: Error: KeyCertSign key usage must not be used with createcert action
fr_fr: Erreur: Le keyusage KeyCertSign ne doit pas être utilisé avec l'action createcert

# CLI_DN_CERT_NOT_FOUND_ERROR
source: Certificate with DN %s cannot be found
fr_fr: Aucun certificat ne correspond au DN %s

# CLI_NAME_CERT_NOT_FOUND_ERROR
source: Certificate with name %s cannot be found
fr_fr: Aucun certificat ne correspond au nom %s

# CLI_DN_CERT_NOT_A_CA_ERROR
source: Certificate with DN %s is not a CA Certificate
fr_fr: Le certificate %s n'est pas un certificat d'AC

# CLI_CERT_CREATION_ERROR
source: Error, certificate not created
fr_fr: Erreur lors de la création du certificat.

# CLI_DN_AND_NAME_SET_ERROR
source: Invalid option --name : --dn already specified
fr_fr: Option --name invalide : --dn déjà défini

# CLI_NO_DN_NAME_SET_ERROR
source: No certificate specified. See options --dn and --name
fr_fr: Options --dn et --name non définies

# CLI_P12_NO_PASSWORD_SET
source: Password option must be set
fr_fr: Aucun mot de passe d'export n'est défini.

# CLI_LIST_NO_AC_FOUND
source: No CA certificate found/.
fr_fr: Aucun certificat d'AC présent.

# CLI_RENEW_SELFSIGN_NOT_IMPLEMENTED
source: Error: selfsigned certificate renewal not implemented.
fr_fr: Erreur: Renouvellement de certificat auto-signé non implémenté.

# CLI_CERT_DN_ALREADY_EXISTS
source: Error: Certificat with DN (%s) already exists.
fr_fr: Erreur: Un certificat avec le DN %s existe déjà.

# CLI_DN_CERT_NOT_SELFSIGNED_ERROR
source: Certificate %s is not self signed.
fr_fr: Le certificate %s n'est pas auto-signé.

# CLI_ATTACHCA_USAGE
source: Import a anssipki created certificate signed by a third party CA.
fr_fr: Importe un certificat d'AC créé par l'anssipki et signé par une AC tierce.

# CLI_IMPORT_NO_IN_ERROR
source: Error: No input field specified.
fr_fr: Erreur: Aucun fichier d'entrée n'est spécifié.

# CLI_ATTACH_ERROR
source: Error: bad certificate provided for CA attach action.
fr_fr: Erreur: mauvais certificat passé pour l'action d'attachement d'AC.

# CLI_CRL_WRITTEN_TO
source: The CRL has been generated : %s
fr_fr: La crl été correctement généré : %s

# CLI_CREATECRL_USAGE
source: Build a CRL for a specified CA
fr_fr: Création d'une liste de revocation pour un certificat d'AC

# CLI_CREATECRL_OUT_OPTION_HELP
source: CRL Output file
fr_fr: Fichier de sortie pour la CRL

# CLI_REVOKE_USAGE
source: Revoke a certificate.
fr_fr: Révoque un certificat.

# CLI_CREATECA_USAGE
source: Create a root CA
fr_fr: Création d'une AC racine

# CLI_CREATESUBCA_USAGE
source: Create a sub CA
fr_fr: Création d'une sous-AC

# CLI_CREATECERT_USAGE
source: Create a child certificate.
fr_fr: Création d'un certificat fils.

# CLI_RENEW_USAGE
source: Renew a certificate.
fr_fr: Renouvelle un certificat pour une nouvelle période de validité

# CLI_SHOWLOGS_USAGE
source: Show application logs
fr_fr: Affiche les journaux applicatifs

# CLI_LIST_USAGE
source: Print the certificates tree
fr_fr: Affiche l'arbre des certificats générés.

# CLI_INFO_USAGE
source: Show internal informations
fr_fr: Affiche les informations internes au programme.

# CLI_AVAILABLE_TEMPLATES
source: Available templates :
fr_fr: Templates disponibles :

# CLI_AVAILABLE_SIGNALGO
source: Available sign algorithms :
fr_fr: Algorithmes de signature disponibles :

# CLI_REVOKE_REASON_OPTION_HELP
source: Revocation reason
fr_fr: Raison de révocation
